XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_gptim.h
#define    GPTIM_CR2_MMS_H_Pos                                    (25U)
#define    GPTIM_CR2_MMS_H_Msk                                    (0x1U << GPTIM_CR2_MMS_H_Pos)
#define    GPTIM_CR2_MMS_H                                        GPTIM_CR2_MMS_H_Msk

#define    GPTIM_CR2_TI1S_Pos                                     (7U)
#define    GPTIM_CR2_TI1S_Msk                                     (0x1U << GPTIM_CR2_TI1S_Pos)
#define    GPTIM_CR2_TI1S                                         GPTIM_CR2_TI1S_Msk

#define    GPTIM_CR2_MMS_Pos                                      (4U)
#define    GPTIM_CR2_MMS_Msk                                      (0x7U << GPTIM_CR2_MMS_Pos)
#define    GPTIM_CR2_MMS                                          GPTIM_CR2_MMS_Msk

#define    GPTIM_CR2_CCDS_Pos                                     (3U)
#define    GPTIM_CR2_CCDS_Msk                                     (0x1U << GPTIM_CR2_CCDS_Pos)
#define    GPTIM_CR2_CCDS                                         GPTIM_CR2_CCDS_Msk

#define    GPTIM_SMCR_SMSPS_Pos                                   (25U)
#define    GPTIM_SMCR_SMSPS_Msk                                   (0x1U << GPTIM_SMCR_SMSPS_Pos)
#define    GPTIM_SMCR_SMSPS                                       GPTIM_SMCR_SMSPS_Msk

#define    GPTIM_SMCR_SMSPE_Pos                                   (24U)
#define    GPTIM_SMCR_SMSPE_Msk                                   (0x1U << GPTIM_SMCR_SMSPE_Pos)
#define    GPTIM_SMCR_SMSPE                                       GPTIM_SMCR_SMSPE_Msk


#define    GPTIM_SMCR_OCCS_Pos                                    (16U)
#define    GPTIM_SMCR_OCCS_Msk                                    (0x1U << GPTIM_SMCR_OCCS_Pos)
#define    GPTIM_SMCR_OCCS                                        GPTIM_SMCR_OCCS_Msk

#define    GPTIM_SMCR_ETP_Pos                                     (15U)
#define    GPTIM_SMCR_ETP_Msk                                     (0x1U << GPTIM_SMCR_ETP_Pos)
#define    GPTIM_SMCR_ETP                                         GPTIM_SMCR_ETP_Msk

#define    GPTIM_SMCR_ECE_Pos                                     (14U)
#define    GPTIM_SMCR_ECE_Msk                                     (0x1U << GPTIM_SMCR_ECE_Pos)
#define    GPTIM_SMCR_ECE                                         GPTIM_SMCR_ECE_Msk

#define    GPTIM_SMCR_ETPS_Pos                                    (12U)
#define    GPTIM_SMCR_ETPS_Msk                                    (0x3U << GPTIM_SMCR_ETPS_Pos)
#define    GPTIM_SMCR_ETPS                                        GPTIM_SMCR_ETPS_Msk

#define    GPTIM_SMCR_ETF_Pos                                     (8U)
#define    GPTIM_SMCR_ETF_Msk                                     (0xfU << GPTIM_SMCR_ETF_Pos)
#define    GPTIM_SMCR_ETF                                         GPTIM_SMCR_ETF_Msk

#define    GPTIM_SMCR_MSM_Pos                                     (7U)
#define    GPTIM_SMCR_MSM_Msk                                     (0x1U << GPTIM_SMCR_MSM_Pos)
#define    GPTIM_SMCR_MSM                                         GPTIM_SMCR_MSM_Msk

#define    GPTIM_SMCR_TS_Pos                                    	(4U)
#define    GPTIM_SMCR_TS_Msk                                    	(0x7U << GPTIM_SMCR_TS_Pos)
#define    GPTIM_SMCR_TS                                      		GPTIM_SMCR_TS_Msk

#define    GPTIM_SMCR_SMS_Pos                                     (0U)
#define    GPTIM_SMCR_SMS_Msk                                     (0xfU << GPTIM_SMCR_SMS_Pos)
#define    GPTIM_SMCR_SMS                                         GPTIM_SMCR_SMS_Msk

#define    GPTIM_DIER_TERRIR_Pos                                  (23U)
#define    GPTIM_DIER_TERRIR_Msk                                  (0x1U << GPTIM_DIER_TERRIR_Pos)
#define    GPTIM_DIER_TERRIR                                      GPTIM_DIER_TERRIR_Msk

#define    GPTIM_DIER_TERRIE_Pos                                  (23U)
#define    GPTIM_DIER_TERRIE_Msk                                  (0x1U << GPTIM_DIER_TERRIE_Pos)
#define    GPTIM_DIER_TERRIE                                      GPTIM_DIER_TERRIE_Msk

#define    GPTIM_DIER_IERRIE_Pos                                  (22U)
#define    GPTIM_DIER_IERRIE_Msk                                  (0x1U << GPTIM_DIER_IERRIE_Pos)
#define    GPTIM_DIER_IERRIE                                      GPTIM_DIER_IERRIE_Msk

#define    GPTIM_DIER_DIRIE_Pos                                   (21U)
#define    GPTIM_DIER_DIRIE_Msk                                   (0x1U << GPTIM_DIER_DIRIE_Pos)
#define    GPTIM_DIER_DIRIE                                       GPTIM_DIER_DIRIE_Msk

#define    GPTIM_DIER_IDXIE_Pos                                   (20U)
#define    GPTIM_DIER_IDXIE_Msk                                   (0x1U << GPTIM_DIER_IDXIE_Pos)
#define    GPTIM_DIER_IDXIE                                       GPTIM_DIER_IDXIE_Msk

#define    GPTIM_DIER_CC3BURSTEN_Pos                              (18U)
#define    GPTIM_DIER_CC3BURSTEN_Msk                              (0x1U << GPTIM_DIER_CC3BURSTEN_Pos)
#define    GPTIM_DIER_CC3BURSTEN                                  GPTIM_DIER_CC3BURSTEN_Msk

#define    GPTIM_DIER_CC4BURSTEN_Pos                              (19U)
#define    GPTIM_DIER_CC4BURSTEN_Msk                              (0x1U << GPTIM_DIER_CC4BURSTEN_Pos)
#define    GPTIM_DIER_CC4BURSTEN                                  GPTIM_DIER_CC4BURSTEN_Msk

#define    GPTIM_DIER_CC2BURSTEN_Pos                              (17U)
#define    GPTIM_DIER_CC2BURSTEN_Msk                              (0x1U << GPTIM_DIER_CC2BURSTEN_Pos)
#define    GPTIM_DIER_CC2BURSTEN                                  GPTIM_DIER_CC2BURSTEN_Msk

#define    GPTIM_DIER_CC1BURSTEN_Pos                              (16U)
#define    GPTIM_DIER_CC1BURSTEN_Msk                              (0x1U << GPTIM_DIER_CC1BURSTEN_Pos)
#define    GPTIM_DIER_CC1BURSTEN                                  GPTIM_DIER_CC1BURSTEN_Msk

#define    GPTIM_DIER_TDE_Pos                                     (14U)
#define    GPTIM_DIER_TDE_Msk                                     (0x1U << GPTIM_DIER_TDE_Pos)
#define    GPTIM_DIER_TDE                                         GPTIM_DIER_TDE_Msk

#define    GPTIM_DIER_CCDE_Pos                                    (9U)
#define    GPTIM_DIER_CCDE_Msk                                    (0xfU << GPTIM_DIER_CCDE_Pos)
#define    GPTIM_DIER_CCDE                                        GPTIM_DIER_CCDE_Msk

